[{"name":"Shoulders_t-press","step1":"1. Lie on your belly with your legs fully extended and your arms forming a T\r\nshape with your body.\r\n"},{"name":"Shoulders_side-plank","step1":"1. Start in a side plank position, with your right shoulder over your elbow, your\r\nbody in a straight line and reach your left hand toward the ceiling.\r\n"},{"name":"Shoulders_plank-straight-arm-kickback","step1":"1. Grab a set of dumbbells and get into plank position, with your wrists under\r\nyour shoulders and your feet hip-width apart.\r\n"},{"name":"Shoulders_inchworm","step1":"1. Stand straight with your feet shoulder-width apart.\r\n"},{"name":"Shoulders_bear-squats","step1":"1. Get down on your hands and knees, with your wrists under your shoulders\r\nand your knees hip-width apart.\r\n"},{"name":"Legs_walking-lunges","step1":"1. Stand with your feet hip-width apart, take a step forward with your right\r\nfoot and then slowly bend both knees until your back knee is just above the\r\nfloor.\r\n"},{"name":"Legs_touch-and-hop","step1":"1. Stand on your right leg with your knee slightly bent.\r\n"},{"name":"Legs_side-lunge","step1":"1. Stand tall with your feet hip-width apart.\r\n"},{"name":"Legs_lunge-back-kick","step1":"1. Start with your feet hip-width apart, take a step to the front with your right\r\nleg, and lunge.\r\n"},{"name":"Legs_jump-start","step1":"1. Stand on your left leg, bend your knee, extend your right leg back, and touch\r\nyour left foot with your right hand.\r\n"},{"name":"Legs_in-and-out-jacks","step1":"1. Stand straight with your feet together and hands by your sides.\r\n"},{"name":"Legs_heisman","step1":"1. Stand tall with your feet hip width apart and with your knees slightly bent.\r\n"},{"name":"Legs_flutter-kick-squats","step1":"1. Stand with your feet shoulder-width apart and with one foot forward and\r\nthe other foot behind you.\r\n"},{"name":"Legs_dumbbell-swing","step1":"1. Stand with your feet shoulder-width apart, your toes pointed slightly\r\noutward, and hold a dumbbell with both hands.\r\n"},{"name":"Glutes_side-legs-lifts","step1":"1. Lie on your side with your legs fully extended and stacked.\r\n\r\n"},{"name":"Glutes_rolling-squat","step1":"1. Stand up at the front of the mat with your feet shoulder-width apart.\r\n"},{"name":"Glutes_plie-squat-scoop-up","step1":"1. Stand with your feet in a wide stance, your toes pointing out to the sides,\r\nand hold a dumbbell in each hand with your palms facing up.\r\n"},{"name":"Glutes_frog-bridge","step1":"1. Lie on your back, bend your arms and knees, press the soles of your feet\r\ntogether and let your thighs fall open.\r\n"},{"name":"Glutes_double-pulse-squat-jump","step1":"1. Stand with your feet shoulder-width apart and the toes pointing slightly\r\noutward.\r\n"},{"name":"Glutes_diamond-kicks","step1":"1. Lie on your back with your arms by your sides, raise the legs toward the\r\nceiling, bend the knees and bring the soles of your feet together (like a frog).\r\n"},{"name":"Chest_dumbbell-pullover-leg","step1":"1. Lie on your back with your knees bent and hold a dumbbell with both hands.\r\n"},{"name":"Chest_chest-press-with-less-extended","step1":"1. Lie on your back, holding a dumbbell in each hand, and raise your legs to a\r\n45 degree angle.\r\n"},{"name":"Chest_chest-fly-bridge","step1":"1. Lie on your back with your knees bent and your arms out to the sides,\r\nholding a dumbbell in each hand.\r\n\r\n"},{"name":"Chest_alternating-medicine-ball-push-up","step1":"1. Start in a push up position with your legs extended back, the hands below\r\nthe shoulders and a medicine ball under your left hand.\r\n"},{"name":"Back_plank-hip-dips","step1":"1. Start in a low plank position with your body in a straight line, your elbows\r\nbent and under your shoulders and your feet hip-width apart.\r\n"},{"name":"Back_dumbbell-bent-over-row","step1":"1. Grab a set of dumbbells, bend your torso forward and keep your knees\r\nslightly bent.\r\n"},{"name":"Back_deadlift-upright-row","step1":"1. Stand up with your feet shoulder-width apart and hold a set of dumbbells in\r\nfront of your thighs.\r\n"},{"name":"Back_crab-toe-touch","step1":"1. Sit on the mat with your knees bent, feet together and place your hands\r\nbehind you."},{"name":"Back_cobra-lat-pulldown","step1":"1. Lie on your stomach with your legs and your arms fully extended."},{"name":"Arms_triceps-dips","step1":"1. Place your hands behind you onto a chair, so that your fingers face forward.\r\n\r\n"},{"name":"Arms_reverse-plank-leg-raise","step1":"1. Sit on the mat with your legs extended and place your hands behind you\r\nwith the fingers facing your body.\r\n"},{"name":"Arms_push-ups","step1":"1. With your legs extended back, place the hands below the shoulders, slightly\r\nwider than shoulder-width apart.\r\n"},{"name":"Arms_pike-push-ups","step1":"1. Get down on your hands and feet, with your hands shoulder-width apart,\r\nyour legs straight and your hips up."},{"name":"Arms_lying-tricep-extension","step1":"1. Lie on your back with your knees bent and a dumbbell in each hand.\r\n"},{"name":"Arms_curl","step1":"1. Sit down on a bench holding a dumbbell in your left hand, and rest your\r\nelbow on the inside of your left thigh."},{"name":"Abs_v-sit-bicycles","step1":"1. Lie down with your legs slightly bent.\r\n"},{"name":"Abs_seated-knee-tucks","step1":"1. Sit down with your hands on the mat, your legs fully extended and lean back."},{"name":"Abs_scissor-kicks","step1":"1. Lie on your back with your hands by your sides or place them underneath your glutes."},{"name":"Abs_reverse-crunches","step1":"1. Lie on your back with your hands by your sides.\r\nLift your knees until your thighs and calves form a\r\n90-degree angle and your calves are parallel to the\r\nfloor."},{"name":"Abs_plank-bird-dog","step1":"1. Start in a plank position with your body in a\r\nstraight line, your wrists under your shoulders and\r\nyour feet shoulder-width apart."},{"name":"Abs_mountain-climbers","step1":"1. Start with your body in a straight line and your\r\nhands slightly wider than shoulder-width apart.\r\nKeep your toes and balls of the feet touching the floor."},{"name":"Abs_bent-leg-jackknife","step1":"1. Lie on your back with your legs straight and your\r\narms extended back.\r\n"},{"name":"Abs_ankle-tap-pushups","step1":"1. Start in a push up position, with your hands\r\nunder your shoulders and your legs extended back"},{"name":"Abs_alternate-heel-touchers","step1":"1.Lie on your back, keep your knees bent, arms at\r\nthe sides, and keep your back and feet flat on the mat."}]